app/Models/CarrosModel.php

    public function getCarros() {

        return $this->findAll();
---
SELECT *
FROM `tb_carros`

    public function getCarro($id) {
        return $this->asArray()->where(['id'=>$id])->first();
---
SELECT *
FROM `tb_carros`
WHERE `id` = '10'
 LIMIT 1