app/Models/PessoasModel.php

    public function getPessoas() {

        return $this->findAll();
---
SELECT *
FROM `tb_pessoas`